#  The First Normal Form (1NF)

##  Learning Objectives
By the end of this exercise, you should be able to:
- Understand the requirements for achieving the **First Normal Form (1NF)**.  
- Identify and establish a **primary key** to ensure data integrity.  
- Transform a table into 1NF using the `Company_employees` dataset.

In [1]:
%load_ext sql

##  Step 1 — View the Current Table

Let’s take a look at the `Company_employees` table to understand its structure.

In [5]:
%%sql

SELECT 
    * 
FROM 
    Company_employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
5 rows affected.

[('E001', 'Carmel', 'J01', 'Chef', 26, 'Cape Town'),
 ('E001', 'Carmel', 'J02', 'Waiter', 26, 'Cape Town'),
 ('E002', 'Stefanie', 'J02', 'Waiter', 56, 'Joburg'),
 ('E002', 'Stefanie', 'J03', 'Bartender', 56, 'Joburg'),
 ('E003', 'Lisa', 'J01', 'Chef', 5, 'Nairobi')]

##  Step 2 — Understanding the Table Structure

The table currently includes multiple entries for some employees who hold different job roles.

| Employee_id | Name     | Job_code | Job_title  | State_code | Home_state |
|--------------|----------|-----------|-------------|-------------|-------------|
| E001         | Carmel   | J01       | Chef        | 26          | Cape Town   |
| E001         | Carmel   | J02       | Waiter      | 26          | Cape Town   |
| E002         | Stefanie | J02       | Waiter      | 56          | Joburg      |
| E002         | Stefanie | J03       | Bartender   | 56          | Joburg      |
| E003         | Lisa     | J01       | Chef        | 5           | Nairobi     |

Each row represents **one employee-job combination**, which means the data already meets the **atomicity rule**.  
However, we still need to ensure there is a **unique identifier** (Primary Key) for each record.

##  Step 3 — Create a 1NF-Compliant Table

We’ll create a new table, `Company_employees_1NF`, that contains the same data but introduces a **unique primary key** column (`Record_ID`).

In [6]:
%%sql

CREATE TABLE Company_employees_1NF AS
SELECT
    Employee_id,
    Name,
    Job_code,
    Job_title,
    State_code,
    Home_state
FROM
    Company_employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
5 rows affected.

[]

##  Step 4 — Add a Primary Key

Next, we’ll add a unique auto-incrementing key to ensure each record can be identified individually.

In [7]:
%%sql

ALTER TABLE Company_employees_1NF
ADD COLUMN Record_ID INT AUTO_INCREMENT PRIMARY KEY;

 * mysql+pymysql://root:***@localhost:3306/company_data
0 rows affected.

[]

##  Step 5 — Verify the Normalized Table

Let’s inspect the structure of our new `Company_employees_1NF` table to confirm that it satisfies 1NF requirements.

In [10]:
%%sql

DESCRIBE Company_employees_1NF;

 * mysql+pymysql://root:***@localhost:3306/company_data
7 rows affected.

[('Employee_id', 'varchar(10)', 'NO', '', None, ''),
 ('Name', 'varchar(45)', 'YES', '', None, ''),
 ('Job_code', 'varchar(45)', 'NO', '', None, ''),
 ('Job_title', 'varchar(45)', 'YES', '', None, ''),
 ('State_code', 'int', 'YES', '', None, ''),
 ('Home_state', 'varchar(45)', 'YES', '', None, ''),
 ('Record_ID', 'int', 'NO', 'PRI', None, 'auto_increment')]

##  Summary

In this notebook, we normalized the `Company_employees` table to achieve the **First Normal Form (1NF)** by ensuring:
- Each cell contains only one value (**atomicity**).  
- Each row in the table is unique (**no duplicates**).  
- The table has a **primary key** (`Record_ID`) that uniquely identifies every record.  

By applying 1NF, we improved **data integrity** and laid a strong foundation for higher normalization levels such as **2NF** and **3NF**.